import re
# https://github.com/linuxscout/pyarabic مصدر بعض الدوال

# Diacritics | حركات
FATHATAN = u'\u064b'
DAMMATAN = u'\u064c'
KASRATAN = u'\u064d'
FATHA = u'\u064e'
DAMMA = u'\u064f'
KASRA = u'\u0650'
SHADDA = u'\u0651'
SUKUN = u'\u0652'

TASHKEEL = (FATHATAN, DAMMATAN, KASRATAN, FATHA, DAMMA, KASRA, SUKUN, SHADDA)

TATWEEL = u'\u0640'

bad_words = ['كحبة', 'يلعن', 'ديوث', 'زب', 'الزب', 'ونيكه', 'كسك', 'سيكسي', 'يا رخيص', 'واتفل', 'قحبة', 'دلخ', 'يولاد ال', 'فسختها', 'اه', 'عيري', 'يا اخوات ال', 'زبه', 'فحول', 'غتصب', 'يا ابن ال', 'سكسي', 'الجراره', 'نكت اخته', 'انيك', 'زنوه', '🖕', 'ابن النيك', 'زناة', 'ترضع', 'الخضوع', 'قضيب كبير', 'الديوث', 'مخنث', 'متناك', 'سيكس', 'قحبتي', 'يكسمك', 'ملعون', 'اجري فيك', 'بزاز', 'الـةـواد', 'سكس', 'الكس', 'يجيب ضهرو', 'القحبة', 'رْبي', 'يتناك', 'بغتصبك', 'كسكوس', 'مص', 'انكح', 'العاهره', 'قحىِه', 'تويرك', 'تجليخ', 'شرموطه', 'بنيك', 'ياخنيث', 'المحنه', 'الزنا', 'محنة', 'امك', 'بخرقه', 'كسها', 'تمص', 'عاهر', 'العرص', 'كس عرضك', 'خنيث', 'ولد القحبه', 'مكسكس', 'عاهرة', 'سٌرموطه', 'زبي', 'قحاب', 'شرموط', 'كسمك', 'كس اختك', 'اىْيك', 'نكت امه', 'حلمات', 'يا ولاد ال', 'تنبح', 'جلق', 'منايك', 'بلعن', 'شرج', 'كسمكم', 'العن', 'الدىِوث', 'كسامك', 'يا خوات ال', 'برضع', 'جلخ', 'كسم', 'القواد', 'السافل', 'اشخطك', 'الزانيه', 'كىىىىمك', 'ىثىرموط', 'عرص', 'الزنوه', 'خرق', 'طيز', 'يزغب', 'بعبص', 'ياقواده', 'منيوك', 'ناكك', 'يا زنديق', 'كىىى', 'القحىِه', 'است', 'المتىْاكه', 'ياجرار', 'قضيبي', 'كىىىمك', 'المنيوكه', 'هاذي امك', 'هاذي اختك', 'خنيثه', 'ياقواد', 'هذي امك', 'عديم الشرف', 'اللعن', 'ديد', 'الديوتْ', 'تفو', 'ولد القحبة', 'ايري', 'ابن عاهر', 'ياقحبه', 'ديود', 'ىْيكة', 'مكوتها', 'لحس', 'اهنيك', 'قحب', 'نياكه', 'خصيانه', 'الساقط', 'كس', 'مخانيث', 'ممحون', 'محنه', 'الزاني', 'ختفوووو', 'يا كافر', 'تخنث', 'قحيب', 'عيال الحرام', 'ياقحىِه', 'لعنه', 'تزغيب', 'افسخك', 'جنس', 'الرْنا', 'بعص', 'الكحبه', 'فجور', 'جرار', 'بركبك', 'انيكك', 'شرمها', 'وكىىىمها', 'هذي اختك', 'الشرموطه', 'ياديوث', 'وانىِكك', 'كسا', 'قحبه', 'مصي', 'الجرار', 'اخو ال', '👉👌', 'الشرموطة', 'خول', 'احلي كث', 'كس ', 'لقحاب', 'نياكة', 'الكحبة', 'السٌرموطه', 'وشتمتك', 'كس امك', 'دعارة', 'اههه', 'شرموطة', 'القحبه', 'بكسمك', 'مبعوص', 'نيك', 'منيك', 'بكىىىها', 'انىِك']

class Word:
	def is_tashkeel(archar):
		"""يتحقق مما إذا كان الحرف المعطى هو أحد علامات التشكيل العربية (فتحة، ضمة، كسرة، سكون، شدة، فتحتان، ضمتان، كسرتان)."""
		return archar in TASHKEEL

	def is_vocalized(word):
		"""يتحقق مما إذا كانت الكلمة العربية مشكولة. يجب ألا تحتوي الكلمة على أي مسافات أو علامات ترقيم."""
		if word.isalpha():
			return False
		for char in word:
			if Word.is_tashkeel(char):
				break
		else:
			return False
		return True

	def strip_tatweel(text): # هذي تشيل التطويل من الحروفــــــــــــ
		"""
		إزالة التطويل والتشكيل من نص عربي وإعادة النص نظيفًا.
		مثال:
			>>> text = "العـــــربية"
			>>> strip_tatweel(text)
			'العربية'

		@param text: نص عربي.
		@type text: unicode.
		@return: نص منظف من التطويل والتشكيل.
		@rtype: unicode.
		"""
		# إزالة التطويل
		text = text.replace(TATWEEL, '')
		# إزالة التشكيل
		for char in TASHKEEL:
			text = text.replace(char, '')
		return text

	def remove_special_characters(text):
		"""إزالة الأحرف الخاصة المحددة من النص."""
		characters_to_remove = "/*-+.+_()*&^%$#@!ّذ\"':;{}[]\\|/?<>,."
		for character in characters_to_remove:
			text = text.replace(character, "")
		return text
	
	def remove_emojis(text):
		"""إزالة الإيموجيات من النص."""
		emoji_pattern = re.compile(
			"[" 
			"\U0001F600-\U0001F64F"  # الوجوه التعبيرية
			"\U0001F300-\U0001F5FF"  # الرموز والصور التوضيحية
			"\U0001F680-\U0001F6FF"  # رموز النقل والخرائط
			"\U0001F700-\U0001F77F"  # الرموز الكيميائية
			"\U0001F780-\U0001F7FF"  # الأشكال الهندسية الموسعة
			"\U0001F800-\U0001F8FF"  # الأسهم التكميلية-C
			"\U0001F900-\U0001F9FF"  # الرموز والصور التوضيحية التكميلية
			"\U0001FA00-\U0001FA6F"  # رموز الشطرنج
			"\U0001FA70-\U0001FAFF"  # الرموز والصور التوضيحية الموسعة-A
			"\U00002702-\U000027B0"  # الزخارف
			"\U000024C2-\U0001F251" 
			"]+", flags=re.UNICODE
		)
		return emoji_pattern.sub(r'', text)

	def remove_repeated_characters(text):
		"""إزالة الحروف المتكررة المتتابعة في النص."""
		return re.sub(r'(.)\1+', r'\1', text)

	def BadWord(text): # هنا فلتر الكلام الوصخ اذ كانت صح معناه فيه كلام مو زين والعكس # from MrXD
		"""
		هاذي دالة فلتر الكلام اذ كلام وصخ يعطيك True
		واذ كان مافيه يعطيك False
		"""
		msg = Word.strip_tatweel(text)
		msg = Word.remove_special_characters(msg)
		msg = Word.remove_emojis(msg)
		msg = Word.remove_repeated_characters(msg)
		msgcat = msg.split()
		for word in msgcat:
			if word in bad_words:
				return True
		return False
